335616zrz/Desigof-a-Smart-Home-Central-Control-System-Based-on-LVGL-and-FreeRTOS-/software_part/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_table/partitions_custom.csv"
CONFIG_APP_ENABLE_MUSIC=y
CONFIG_APP_MUSIC_SKIP_CN_CHECK=y
CONFIG_APP_OTA_ENABLE=y
CONFIG_APP_OTA_AUTO_START=n
CONFIG_APP_OTA_SKIP_CN_CHECK=y
CONFIG_APP_OTA_HTTP_RX_BUFFER_SIZE=16384
CONFIG_APP_OTA_BULK_FLASH_ERASE=y
# WS2812 Night Light / Alarm - 默认启用 PSRAM 栈 + 轻量 JSON 解析
CONFIG_APP_WS2812_ENABLE=y
CONFIG_APP_WS2812_USE_PSRAM_STACK=y
CONFIG_APP_WS2812_LIGHTWEIGHT_JSON=y
CONFIG_MY_UI_CHATBOT_ENABLE=y
CONFIG_MY_UI_CHATBOT_PORT=443
CONFIG_MY_UI_CHATBOT_TLS=y
CONFIG_MY_UI_CHATBOT_PING_INTERVAL_SEC=15
CONFIG_MY_UI_WEATHER_HOST="servers.local"
CONFIG_MY_UI_WEATHER_PORT=3001
CONFIG_LVGL_PORT_EXTRA_MEM_KB=512
CONFIG_SR_MN_CN_MULTINET7_QUANT=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_LOG_COLORS=n
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MQTT_PROTOCOL_311=n
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_AUDIO_PLAYER_HTTP_BUFSZ=4096
CONFIG_AUDIO_PLAYER_RINGBUF_SZ=32768
CONFIG_AUDIO_PLAYER_HTTP_STACK_IN_EXT=y
CONFIG_AUDIO_PLAYER_DEC_TASK_PRIO=6
CONFIG_HTTP_STREAM_SUPPORT_GZIP=n
CONFIG_HTTP_STREAM_SUPPORT_PLAYLIST=n
CONFIG_LVGL_PORT_BUF_LINES=16
# Wi-Fi credentials - REPLACE with your own values locally
# These are placeholder values, override in sdkconfig or menuconfig
CONFIG_NET_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_NET_WIFI_PASSWORD="YOUR_WIFI_PASSWORD"
CONFIG_NET_WIFI_POWER_SAVE=n
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=64
CONFIG_LV_USE_LOG=y
CONFIG_LV_USE_FLOAT=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_IME_PINYIN=y
CONFIG_LV_IME_PINYIN_USE_K9_MODE=y
CONFIG_LV_IME_PINYIN_USE_DEFAULT_DICT=n
CONFIG_LV_BUILD_EXAMPLES=n
